.loadtest/main.yaml
---
settings:
  check-interval: 5s
  default-executor: jmeter
  env:
    BASE_URL: "http://127.0.0.1:8080"

reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: true  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: ./stats.xml
  dump-csv: ./data.csv
- module: console

execution:
- concurrency: 50   # use `my_conc` prop or default=3 if property isn't found
  ramp-up: 3
  throughput: 20
  hold-for: 1m
  scenario: tsxample

modules:
  jmeter:
    gui: false

scenarios:
  tsxample:
    store-cache: false
    store-cookie: false
    follow-redirects: true
    default-address: ${BASE_URL}
    think-time: 400ms
    #timeout: 1s
    requests:
      - url: ${BASE_URL}/
        label: 'Root path'
        method: GET
        #assert-jsonpath:
        #  - "$."
      - url: ${BASE_URL}/mirror
        method: POST
        label: 'JSON dump'
        headers:
          Content-Type: application/json
        body:
          '{"user":"start","roll":"mentor"}'